# Indexing and SQLite

In [1]:
import sqlite3

In [3]:
db = sqlite3.connect('IMDB.sqlite')
db

In [4]:
# new database 

db = sqlite3.connect('School.sqlite')
db

In [5]:
# create cursor object
cur = db.cursor()
cur

In [6]:
# create new table
sql_query = 'create table Student(RollNo int Primary Key,Name Text,Age int)'

# execute this query
cur.execute(sql_query)

In [8]:
cur.execute('Insert into Student values(101,"Aman",20)')

In [9]:
# refect change int database or dbbroweser
db.commit()

In [10]:
cur.execute('Insert into Student values(102,"Akash",21)')
db.commit()

In [11]:
# close connetiom
db.close()

In [13]:
cur.execute('Insert into Student values(102,"Akash",21)')
db.commit()

ProgrammingError: Cannot operate on a closed database.

### Assignment create Employe Table

In [2]:
db = sqlite3.connect('Employee.sqlite')
cur = db.cursor()

In [3]:
cur.execute('create table EmployeeDetail(Employee_id int Primary Key, Name varchar(100), Age int, Department varchar(100), Salary int)')
db.commit()

OperationalError: table EmployeeDetail already exists

In [7]:
cur.execute('insert into EmployeeDetail values(100,"Rishav",25,"Marketing",50000),(101,"Abhishek",26,"Operation",60000),(102,"Rishav",24,"Human Resource",750000)')

db.commit()

In [31]:
cur.execute('delete from EmployeeDetail where Employee_id = 101')

db.commit()

In [32]:
emp_id = 102
cur.execute('delete from EmployeeDetail where Employee_id = ?',(emp_id,))

db.commit()

In [6]:
cur.execute('delete from EmployeeDetail where Employee_id = 100')

db.commit()

In [10]:
cur.execute('select Employee_id from EmployeeDetail where Department = "Marketing"')
for i in cur:
    print(i)

(100,)

In [12]:
cur.execute('select Department,count(Employee_id) from EmployeeDetail group by Department')
for i in cur:
    print(i)

('Human Resource', 1)
('Marketing', 1)
('Operation', 1)

#### ma'am

In [33]:
db = sqlite3.connect('School.sqlite')
cur = db.cursor()

In [36]:
cur.execute('Insert into Student values(103,"Abid",21)')
db.commit()

OperationalError: database is locked

In [28]:
# passing variable to query
roll = 105
name = "Achyut"
age = 20
cur.execute('Insert into Student values(?,?,?)',(roll,name,age))
db.commit()

OperationalError: database is locked

In [4]:
values = [(105,"Nidhi",20),(106,"Ayushi",21),(107,"Anshuman",20)]
cur.executemany('Insert into Student values(?,?,?)',values)
db.commit()

In [6]:
# update age column
cur.execute('update student set Age = 22')

In [7]:
db.commit()

In [9]:
cur.execute('update student set Age = 21 where RollNo = 102')

In [11]:
db.commit()

In [13]:
new_age = 15
cur.execute('update student set Age = ? where RollNo = 102',(new_age,))

In [14]:
db.commit()

In [35]:
# fetch data

cur.execute('Select * from Student')

In [36]:
for row in cur:
    print(row)

(101, 'Aman', 22)
(102, 'Akash', 15)
(103, 'Abid', 22)
(104, 'Achyut', 22)
(105, 'Nidhi', 22)
(106, 'Ayushi', 22)
(107, 'Anshuman', 22)

In [40]:
# fetchone() || fetchmany() || fectchall()
cur.execute('Select * from Student')
# fetchone()
print(cur.fetchone())
print(cur.fetchone())
print(cur.fetchone())

# fetchmany()
print(cur.fetchmany(3))

# fectchall()
print(cur.fetchall())

(101, 'Aman', 22)
(102, 'Akash', 15)
(103, 'Abid', 22)
[(104, 'Achyut', 22), (105, 'Nidhi', 22), (106, 'Ayushi', 22)]
[(107, 'Anshuman', 22)]

### SQLite with Pandas

In [14]:
import sqlite3
import pandas as pd

db = sqlite3.connect('School.sqlite')

In [16]:
data = pd.read_sql_query('select * from student',db)
data

   RollNo      Name  Age
0     101      Aman   22
1     102     Akash   15
2     103      Abid   22
3     104    Achyut   22
4     105     Nidhi   22
5     106    Ayushi   22
6     107  Anshuman   22

In [20]:
data[data["Age"] == 15]

   RollNo   Name  Age
1     102  Akash   15

In [22]:
data = pd.DataFrame([[201,"Aman","English",20000],[202,"Nikita","Maths",25000],[203,"Rohan","Science",27000]],columns = ["ID","Name","Course","Salary"])
data

    ID    Name   Course  Salary
0  201    Aman  English   20000
1  202  Nikita    Maths   25000
2  203   Rohan  Science   27000

In [24]:
data.to_sql("Faculty",db)

ValueError: Table 'Faculty' already exists.

In [27]:
data = pd.read_sql_query('select * from student',db)
data["Addres"] = "Test"
data

   RollNo      Name  Age Addres
0     101      Aman   22   Test
1     102     Akash   15   Test
2     103      Abid   22   Test
3     104    Achyut   22   Test
4     105     Nidhi   22   Test
5     106    Ayushi   22   Test
6     107  Anshuman   22   Test

In [28]:
# updaate to database
data.to_sql("Student",db,if_exists = "replace")

# ***Assignment IMDB DataBase***

### count each genra and count movies?

In [2]:
import sqlite3
db = sqlite3.connect('IMDB.sqlite')
cur = db.cursor()

In [3]:
cur.execute('select genre,count(Movie_id) from genre group by genre ')
lis = []
for i in cur:
    lis.append(i)
    
print(lis[1:])

[('Action', 33), ('Adventure', 43), ('Animation', 13), ('Biography', 21), ('Comedy', 31), ('Crime', 11), ('Drama', 77), ('Family', 3), ('Fantasy', 7), ('History', 6), ('Horror', 2), ('Music', 3), ('Musical', 1), ('Mystery', 7), ('Romance', 13), ('Sci-Fi', 18), ('Sport', 3), ('Thriller', 14), ('War', 2), ('Western', 2)]

### Print Rating Of The Movies

In [4]:
earn_sum = cur.execute('select Movie_id,Domestic + Worldwide from earning ')
lis = []
for i in earn_sum:
    lis.append(i)
    
res = dict(lis) #converting dict
max_earn = max(res.values()) # maximum earn

movie_id = max(res.items(), key=lambda x : x[1])[0] # getting max value, keys(movies_id)

rating = cur.execute('select rating from IMDB where Movie_id = ?',(movie_id,)) # getting ratting based on movies_id
for i in rating:
    print(i[0])

8.1

### IMDB Most Voted Movies

In [5]:
cur.execute('select max(TotalVotes) from IMDB')
for i in cur:
    max_votes = i[0]
    
cur.execute('select Title,Rating from IMDB where TotalVotes = ?',(max_votes,))
for i in cur:
    print(i[0],i[1])

Inception (2010) 8.8

### IMDB Running Time

In [8]:
cur.execute('select Runtime from IMDB')
res = cur.execute('SELECT MAX(CAST(SUBSTRING(Runtime,5,LEN(Runtime)-4) AS INT)) FROM IMDB WHERE Runtime LIKE "% min"')
for i in res:
    print(i)

OperationalError: no such function: LEN

In [14]:
earn_sum = cur.execute('select IMDB.Title,earning.Domestic + earning.Worldwide - IMDB.Budget from earning Inner join IMDB on earning.Movie_id == IMDB.Movie_id ')
lis = []
for i in earn_sum:
    lis.append(i)
    
lis

[('12 Years a Slave\xa0(2013)', 224405195.0),
 ('127 Hours\xa0(2010)', 61074027.0),
 ('50/50\xa0(2011)', 66201975.0),
 ('About Time\xa0(2013)', 90423370.0),
 ('Amour\xa0(2012)', 17678984.0),
 ('Argo\xa0(2012)', 323851006.0),
 ('Arrival\xa0(2016)', 256934325.0),
 ('Before Midnight\xa0(2013)', 16291096.0),
 ('Big Hero 6\xa0(2014)', 715346440.0),
 ('Birdman or (The Unexpected Virtue of Ignorance)\xa0(2014)', 127555692.0),
 ('Black Swan\xa0(2010)', 423352724.0),
 ('Boyhood\xa0(2014)', 65847562.0),
 ('Bridge of Spies\xa0(2015)', 197792102.0),
 ('Captain America: Civil War\xa0(2016)', 1311388844.0),
 ('Captain America: The Winter Soldier\xa0(2014)', 804030839.0),
 ('Captain Fantastic\xa0(2016)', 6759472.0),
 ('Captain Phillips\xa0(2013)', 270892666.0),
 ('Creed\xa0(2015)', 248335162.0),
 ('Dallas Buyers Club\xa0(2013)', 77496570.0),
 ('Dawn of the Planet of the Apes\xa0(2014)', 749190155.0),
 ('Deadpool\xa0(2016)', 1088183688.0),
 ('Despicable Me\xa0(2010)', 725627970.0),
 ('Detachment\xa0(2011)', 145378.0),
 ('Disconnect\xa0(2012)', -7126200.0),
 ('Django Unchained\xa0(2012)', 488173672.0),
 ('Doctor Strange\xa0(2016)', 745360315.0),
 ('Drive\xa0(2011)', 96235855.0),
 ('Edge of Tomorrow\xa0(2014)', 292747512.0),
 ('End of Watch\xa0(2012)', 82129755.0),
 ('Ex Machina\xa0(2014)', 47312372.0),
 ('Flipped\xa0(2010)', -10489576.0),
 ('Fury\xa0(2014)', 229635812.0),
 ('Gone Girl\xa0(2014)', 476097552.0),
 ('Gravity\xa0(2013)', 897285410.0),
 ('Guardians of the Galaxy\xa0(2014)', 936505229.0),
 ('Hacksaw Ridge\xa0(2016)', 202511969.0),
 ('Harry Potter and the Deathly Hallows: Part 1\xa0(2010)', 1006266610.0),
 ('Hell or High Water\xa0(2016)', 52887721.0),
 ('Her\xa0(2013)', 49919502.0),
 ('Hidden Figures\xa0(2016)', 379732865.0),
 ('How to Train Your Dragon 2\xa0(2014)', 653540443.0),
 ('How to Train Your Dragon\xa0(2010)', 547459990.0),
 ('Hugo\xa0(2011)', 109634667.0),
 ('Hunt for the Wilderpeople\xa0(2016)', 7910936.0),
 ('I, Daniel Blake\xa0(2016)', 520708.0),
 ('Inception\xa0(2010)', 958108959.0),
 ('Inside Out\xa0(2015)', 1039072885.0),
 ('Interstellar\xa0(2014)', 698140034.0),
 ('Kick-Ass\xa0(2010)', 114260206.0),
 ('Kingsman: The Secret Service\xa0(2014)', 461613270.0),
 ('Kubo and the Two Strings\xa0(2016)', 57952633.0),
 ('La La Land\xa0(2016)', 566771482.0),
 ('Les Mis\uf1c3İrables\xa0(2012)', 529619540.0),
 ('Lion\xa0(2016)', 180031485.0),
 ('Lone Survivor\xa0(2013)', 239898513.0),
 ('Mad Max: Fury Road\xa0(2015)', 382494694.0),
 ('Manchester by the Sea\xa0(2016)', 116735493.0),
 ('Me and Earl and the Dying Girl\xa0(2015)', 7833165.0),
 ('Midnight in Paris\xa0(2011)', 190936264.0),
 ('Moana\xa0(2016)', 742088155.0),
 ('Moneyball\xa0(2011)', 135811708.0),
 ('Moonrise Kingdom\xa0(2012)', 97775632.0),
 ('Nebraska\xa0(2013)', 33337784.0),
 ('Nightcrawler\xa0(2014)', 62578434.0),
 ('Philomena\xa0(2013)', 125839851.0),
 ('Pride\xa0(2014)', 8970268.0),
 ('Prisoners\xa0(2013)', 137128989.0),
 ('Rise of the Planet of the Apes\xa0(2011)', 568561234.0),
 ('Rogue One\xa0(2016)', 1388234597.0),
 ('Rush\xa0(2013)', 79195248.0),
 ('Scott Pilgrim vs. the World\xa0(2010)', 19188834.0),
 ('Short Term 12\xa0(2013)', 1026200.0),
 ('Shutter Island\xa0(2010)', 342817129.0),
 ('Sicario\xa0(2015)', 101761737.0),
 ('Silver Linings Playbook\xa0(2012)', 347505411.0),
 ('Sing Street\xa0(2016)', 12861640.0),
 ('Skyfall\xa0(2012)', 1212921290.0),
 ('Spotlight\xa0(2015)', 113402249.0),
 ('Star Trek Into Darkness\xa0(2013)', 506160130.0),
 ('Star Wars: The Force Awakens\xa0(2015)', 2759885849.0),
 ('Straight Outta Compton\xa0(2015)', 334832776.0),
 ('Tangled\xa0(2010)', 532616872.0),
 ('The Artist\xa0(2011)', 163104538.0),
 ('The Avengers\xa0(2012)', 1922170898.0),
 ('The Big Short\xa0(2015)', 175700740.0),
 ('The Book Thief\xa0(2013)', 79074797.0),
 ('The Dark Knight Rises\xa0(2012)', 1283078198.0),
 ('The Fault in Our Stars\xa0(2014)', 420039184.0),
 ('The Fighter\xa0(2010)', 197807878.0),
 ('The Girl with the Dragon Tattoo\xa0(2011)', 245133223.0),
 ('The Grand Budapest Hotel\xa0(2014)', 209102648.0),
 ('The Help\xa0(2011)', 361347224.0),
 ('The Hobbit: An Unexpected Journey\xa0(2012)', 1144107136.0),
 ('The Hobbit: The Desolation of Smaug\xa0(2013)', 991733710.0),
 ('The Hunger Games: Catching Fire\xa0(2013)', 1159679793.0),
 ('The Imitation Game\xa0(2014)', 310681391.0),
 ("The King's Speech\xa0(2010)", 534664692.0),
 ('The Lego Movie\xa0(2014)', 666921384.0),
 ('The Little Prince\xa0(2015)', 17710402.0),
 ('The Martian\xa0(2015)', 750595553.0),
 ('The Perks of Being a Wallflower\xa0(2012)', 38127075.0),
 ('The Revenant\xa0(2015)', 581588397.0),
 ('The Social Network\xa0(2010)', 281883009.0),
 ('The Theory of Everything\xa0(2014)', 144620225.0),
 ('The Town\xa0(2010)', 209212398.0),
 ('The Wolf of Wall Street\xa0(2013)', 408901388.0),
 ('Toy Story 3\xa0(2010)', 1281974583.0),
 ('True Grit\xa0(2010)', 385519932.0),
 ('Tucker and Dale vs Evil\xa0(2010)', -26646.0),
 ('Tyrannosaur\xa0(2011)', -955358.0),
 ('Warrior\xa0(2011)', 11714230.0),
 ('What We Do in the Shadows\xa0(2014)', 8132448.0),
 ('Whiplash\xa0(2014)', 58774041.0),
 ('Wreck-It Ralph\xa0(2012)', 495645778.0),
 ('X-Men: Days of Future Past\xa0(2014)', 781784309.0),
 ('X-Men: First Class\xa0(2011)', 340032429.0),
 ('Zootopia\xa0(2016)', 1215052443.0)]